Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Following the same approach as described in the previous section, JSON-B can be configured using a `io.quarkus.jsonb.JsonbConfigCustomizer` bean.
ja_jp: 前項と同様のアプローチで、 `io.quarkus.jsonb.JsonbConfigCustomizer` beanを使用してJSON-Bを設定することができます。

source: Following the same approach described in the previous section, JSON-B can be configured using an `io.quarkus.jsonb.JsonbConfigCustomizer` bean.
ja_jp: 前のセクションで説明したのと同じアプローチに従って、`io.quarkus.jsonb.JsonbConfigCustomizer` Bean を使用して JSON-B を設定できます。

source: Following the same ideas, you can implement the other CRUD methods.
ja_jp: 同じ考え方で、他のCRUDメソッドも実装できます。

source: Following the same logic, create the `src/main/java/org/acme/services/RedService.java` with the following content:
ja_jp: 同じ要領で、以下の内容の `src/main/java/org/acme/services/RedService.java` を作成します。

source: Following the same logic, the `roomList` field also has an `@ValueRangeProvider` annotation.
ja_jp: 同じロジックに従って、 `roomList` フィールドにも `@ValueRangeProvider` アノテーションがあります。

source: Following the unification of imperative and reactive idea, in Quarkus 1.11, we introduced RESTEasy _reactive_, a novel implementation of the JAX-RS model on top of the Quarkus reactive architecture. It offers a similar development model and much better throughput. I won't detail the RESTEasy _reactive_ architecture and benefits. Georgios covered them in two posts: https://quarkus.io/blog/resteasy-reactive/[RESTEasy Reactive introduction] and https://quarkus.io/blog/resteasy-reactive-faq/[Massive performance without headaches].
ja_jp: 命令型と反応型の考え方の統一を受けて、Quarkus 1.11では、RESTEasy _reactive_ を導入しました。これは、Quarkusのリアクティブアーキテクチャの上にJAX-RSモデルを実装した新しいものです。これは、同様の開発モデルとはるかに優れたスループットを提供します。RESTEasy _reactive_のアーキテクチャと利点については、ここでは詳しく説明しません。Georgiosは2つの投稿でそれらをカバーしています。 link:https://quarkus.io/blog/resteasy-reactive/[RESTEasy Reactive introduction]と link:https://quarkus.io/blog/resteasy-reactive-faq/[Massive performance without headaches]です。

source: Following this advice guarantees applications get the best performance out of the second-level cache and yet avoid unexpected behaviour.
ja_jp: このアドバイスに従うことで、アプリケーションがL2キャッシュから最高のパフォーマンスを引き出し、かつ予期せぬ動作を避けることができます。

source: Following this presentation, Martin Panzer, one of our regular community contributors, opened an https://github.com/smallrye/smallrye-open-api/issues/2401[issue in the SmallRye OpenAPI project] highlighting how slow the build could be for large applications. He provided a solid reproducer, which enabled Mike Edgar to implement several improvements that significantly reduced the contribution of SmallRye OpenAPI to the overall build time.
ja_jp: このプレゼンテーションに続いて、私たちの常連コミュニティ貢献者の一人であるMartin Panzer氏が、大規模アプリケーションのビルドがいかに遅くなるかを示す https://github.com/smallrye/smallrye-open-api/issues/2401[SmallRye OpenAPIプロジェクトの課題] を提起しました。彼は堅牢な再現手順を提供し、これによりMike Edgar氏が、SmallRye OpenAPIが全体のビルド時間にもたらす貢献を大幅に削減するいくつかの改善を実装することができました。

source: Following types can be injected as channels:
ja_jp: チャネルとして注入できるのは、以下のタイプです。

source: Follows an example for H2:
ja_jp: 以下は、H2 の例です。

source: Footer
ja_jp: フッター

source: For 3 and 4, constructor instantiation is prioritesed above method instantiation. Public, protected, and package private constructors and methods are supported for instantiation.
ja_jp: 3 および 4 の場合、コンストラクターによるインスタンス化はメソッドによるインスタンス化よりも優先されます。パブリック、プロテクテッド、およびパッケージプライベートのコンストラクターとメソッドがインスタンス化にサポートされています。

source: For 4.5 or previous versions of OpenShift, you need to use instead:
ja_jp: OpenShiftの4.5以前のバージョンでは、代わりに以下を実行する必要があります:

source: For <<multiple-persistence-units,named persistence units>>, use `@PersistenceUnitExtension("nameOfYourPU")`
ja_jp: <<multiple-persistence-units,named persistence units>> の場合は、 `@PersistenceUnitExtension("nameOfYourPU")` を使用します。

source: For <<multiple-persistence-units,named persistence units>>, use `@PersistenceUnitExtension("nameOfYourPU")`.
ja_jp: <<multiple-persistence-units,named persistence units>> の場合は、 `@PersistenceUnitExtension("nameOfYourPU")` を使用します。

source: For Build stage filters, the index can be passed in (optional)
ja_jp: ビルドステージフィルターの場合、インデックスを渡すことができます (オプション)。

source: For Cassandra metrics to show up, the Cassandra client needs to be initialized and connected; if you are using lazy initialization (see below), you won't see any Cassandra metrics until your application actually connects and hits the database for the first time.
ja_jp: Cassandra メトリクスを表示するには、Cassandra クライアントを初期化して接続する必要があります。遅延初期化 (以下を参照) を使用している場合には、アプリケーションが、実際に接続してデータベースに初めてアクセスするまで、Cassandra メトリクスは表示されません。

source: For Confluent Schema Registry serde, that is:
ja_jp: Confluent Schema Registry serdeについては、以下です。

source: For Docker:
ja_jp: Docker の場合:

source: For Docker: https://docs.docker.com/compose/install/[Installing Docker Compose]
ja_jp: Docker の場合: https://docs.docker.com/compose/install/[Docker Compose のインストール]

source: For Flyway:
ja_jp: Flywayの場合:

source: For FreeMarker we pushed a new extension to the Quarkiverse, with code largely inspired from work by https://github.com/ppalaga[ppalaga] and https://github.com/carlosthe19916[carlosthe19916]. For SMBJ we created an extension in our internal Quarkiverse. And for our logging client, I was able to draw some inspiration from the `quarkus-logging-gelf` extension, and created an additional internal extension.
ja_jp: FreeMarkerについては、 link:https://github.com/ppalaga[ppalaga]と link:https://github.com/carlosthe19916[carlosthe19916]の作業に大きく影響されたコードで、Quarkiverseに新しいエクステンションを導入しました。SMBJについては、社内のQuarkiverseでエクステンションを作成しました。また、ロギングクライアントについては、 `quarkus-logging-gelf` のエクステンションからヒントを得て、追加の社内エクステンションを作成しました。

source: For Funqy: `{url}/funqy`
ja_jp: Funqy の場合: `{url}/funqy`

source: For Funqy: {httpsTrigger.url}/funqy
ja_jp: Funqyの場合: {httpsTrigger.url}/funqy

source: For GET requests, the Funqy HTTP Binding also has a query parameter mapping for function input parameters. Only bean style classes and `java.util.Map` can be used for your input parameter. For bean style classes, query parameter names are mapped to properties on the bean class. Here's an example of a simple `Map`:
ja_jp: GETリクエストのために、Funqy HTTPバインディングは、Function の入力パラメーターのためのクエリパラメーターマッピングも提供しています。Bean スタイル・クラスと `java.util.Map` だけが入力パラメーターに使用できます。Bean スタイル・クラスでは、クエリ・パラメーター名は Bean クラスのプロパティーにマッピングされます。以下は、単純な `Map` の例です。

source: For Gradle projects please <<gradle,see below>>, or for further reference consult the guide in the xref:gradle-tooling.adoc[Gradle setup page].
ja_jp: Gradle プロジェクトの場合は <<gradle,こちらを参照>>。詳細については、xref:gradle-tooling.adoc[Gradle セットアップページ] のガイドを参照してください。

source: For Gradle projects please xref:gradle[see below], or for further reference consult the guide in the xref:gradle-tooling.adoc[Gradle setup page].
ja_jp: Gradleプロジェクトについては、 xref:gradle[以下を参照] するか、 xref:gradle-tooling.adoc[Gradleセットアップページ] のガイドを参照してください。

source: For Gradle, add the dependency in `./greeting-extension/deployment/build.gradle` file:
ja_jp: Gradleの場合は、 `./greeting-extension/deployment/build.gradle` ファイルに依存関係を追加します:

source: For Gradle, add the dependency in `./greeting-extension/runtime/build.gradle` file:
ja_jp: Gradleの場合は、 `./greeting-extension/runtime/build.gradle` ファイルに依存関係を追加します:

source: For Gradle, add the following configuration to the `build.gradle` file:
ja_jp: Gradleの場合は、 `build.gradle` ファイルに以下の設定を追加します：

source: For Gradle, add the following dependency to your project:
ja_jp: Gradle の場合、プロジェクトに次の依存関係を追加します。

source: For Gradle, this means the two types of tests should belong to different source sets.
ja_jp: Gradle の場合、これは 2 種類のテストが異なるソースセットに属する必要があることを意味します。

source: For Gradle, you must use the `--info` switch to see this output.
ja_jp: Gradle の場合、この出力を表示するには `--info` スイッチを使用する必要があります。

source: For Gradle, you need to add the following in `dependencies` section of the `build.gradle` file:
ja_jp: Gradle の場合は、 `build.gradle` ファイルの `dependencies` セクションに以下を追加する必要があります。

source: For Gradle:
ja_jp: Gradleの場合:

source: For HTML and XML templates the `'`, `"`, `<`, `>`, `&` characters are escaped by default if a corresponding template variant is set. For JSON templates the `"`, `\` and the control characters (`U+0000` through `U+001F`) are escaped by default if a corresponding template variant is set.
ja_jp: HTML および XML テンプレートでは、対応するテンプレートバリアントが設定されている場合に、`'`, `"`, `<`, `>`, `&` 文字はデフォルトでエスケープされます。 JSON テンプレートの場合、対応するテンプレートバリアントが設定されている場合、`"`、`\`、および制御文字 (`U+0000` から `U+001F`) はデフォルトでエスケープされます。

source: For HTML and XML templates the `'`, `"`, `<`, `>`, `&` characters are escaped by default if a template variant is set.
ja_jp: HTML と XML テンプレートの場合、 `'` , `"` , `<` , `>` , `&` の文字は、テンプレートバリアントが設定されている場合はデフォルトでエスケープされます。

source: For HTTP, the important method to override is `LambdaIdentityProvider.authenticate(APIGatewayV2HTTPEvent event)`. From this you will allocate a SecurityIdentity based on how you want to map security data from `APIGatewayV2HTTPEvent`
ja_jp: HTTP の場合、オーバーライドする重要なメソッドは `LambdaIdentityProvider.authenticate(APIGatewayV2HTTPEvent event)` です。ここで、 `APIGatewayV2HTTPEvent` からセキュリティーデータをマッピングする方法に基づいて SecurityIdentity を割り当てます。

source: For JAX-RS: {httpsTrigger.url}/hello
ja_jp: JAX-RSの場合: {httpsTrigger.url}/hello

source: For JDBC, the preferred datasource and connection pooling implementation is https://agroal.github.io/[Agroal].
ja_jp: JDBC の場合、データソースと接続プーリングの実装は https://agroal.github.io/[Agroal] が好まれます。

source: For JDK versions prior to 24, Quarkus supports link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[Application Class Data Sharing (AppCDS)] as a fallback. AppCDS provides more modest startup improvements compared to Leyden AOT, but works on older JDKs.
ja_jp: JDK 24 未満のバージョンでは、Quarkus はフォールバックとして link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[Application Class Data Sharing (AppCDS)] をサポートしています。 AppCDS による起動の改善は Leyden AOT に比べると控えめですが、古い JDK でも動作します。

source: For JSON serialization, Netty uses their custom implementation of thread locals, `FastThreadLocal` to store buffers. When using virtual threads in quarkus, the number of virtual threads simultaneously living in the service is directly related to the incoming traffic. It is possible to get hundreds of thousands, if not millions, of them.
ja_jp: JSONのシリアライゼーションでは、Nettyはスレッドローカルの独自実装を使用しています。 `FastThreadLocal` にバッファを保存します。Quarkusで仮想スレッドを使用する場合、サービス内に同時に存在する仮想スレッドの数は受信するトラフィックに直接関係します。数百万とまではいかなくても、数十万程度はあり得ます。

source: For Jakarta REST: `{url}/hello`
ja_jp: Jakarta REST の場合: `{url}/hello`

source: For Jakarta REST: {httpsTrigger.url}/hello
ja_jp: Jakarta RESTの場合: {httpsTrigger.url}/hello

source: For Java developers building Kubernetes operators, this approach opens up a large part of the Go ecosystem without leaving the JVM.
ja_jp: Kubernetes オペレーターを構築する Java 開発者にとって、このアプローチは JVM を離れることなく Go エコシステムの大部分を活用する道を切り開きます。

source: For Java enterprise developers and architects looking to expand their skill set into artificial intelligence and machine learning (AI/ML), getting started can feel intimidating, especially when faced with complex theory, data science, and unfamiliar programming languages.
ja_jp: 人工知能と機械学習（AI/ML）にスキルセットを広げたいと考えているJavaエンタープライズ開発者やアーキテクトにとって、特に複雑な理論、データサイエンス、不慣れなプログラミング言語に直面すると、始めるのが難しく感じられるかもしれません。

source: For Kafka producer client serialization failures are not recoverable, thus the message dispatch is not retried. In these cases you may need to apply a failure strategy for the serializer. To achieve this, you need to create a bean implementing `SerializationFailureHandler<T>` interface:
ja_jp: Kafka プロデューサーの場合、クライアントのシリアライゼーションのエラーは回復できないため、メッセージディスパッチは再試行されません。このような場合、シリアライザーのエラーストラテジーを適用する必要があるかもしれません。 これを実現するには、 `SerializationFailureHandler<T>` インターフェイスを実装する Bean を作成する必要があります。

source: For Keycloak keystore, use the `keycloak-keystore.jks` file located at https://github.com/quarkusio/quarkus-quickstarts/blob/main/security-keycloak-authorization-quickstart/config/keycloak-keystore.jks[quarkus-quickstarts/security-keycloak-authorization-quickstart/config].
ja_jp: Keycloak キーストアの場合は、 https://github.com/quarkusio/quarkus-quickstarts/blob/main/security-keycloak-authorization-quickstart/config/keycloak-keystore.jks[quarkus-quickstarts/security-keycloak-authorization-quickstart/config] にある `keycloak-keystore.jks` ファイルを使用します。

source: For Linux & MacOS users
ja_jp: Linux および MacOS ユーザー向け

source: For Linux hosts execute:
ja_jp: Linuxホストの場合は以下を実行します。

source: For Linux hosts, execute:
ja_jp: Linux ホストの場合は以下を実行します。

source: For Linux, macOS, and Windows (using WSL or bash compatible shell like Cygwin or MinGW)
ja_jp: Linux、macOS、Windows (WSL または Cygwin や MinGW のような bash 互換シェルを使用) の場合

source: For Liquibase Mongodb:
ja_jp: Liquibase Mongodb の場合:

source: For Liquibase:
ja_jp: Liquibaseの場合:

source: For Maven, add the following to your `pom.xml`.
ja_jp: Mavenの場合は、 `pom.xml` に以下を追加します。

source: For Maven, this means that the former should be run by the surefire plugin while the latter should be run by the failsafe plugin.
ja_jp: Maven の場合、前者は surefire プラグインによって、後者は failsafe プラグインによって実行される必要があることを意味します。

source: For Maven:
ja_jp: Maven の場合。

source: For MongoDB with Panache, you could use the `@MongoEntity` annotation on your data class for this:
ja_jp: MongoDB with Panache では、データクラスに `@MongoEntity` アノテーションを使用することができます。

source: For OIDC, you validate the ID token as proof of authentication validity whereas in the case of OAuth2, you validate the access token. This is done by subsequently calling an endpoint that requires the access token and that typically returns user information. This approach is similar to the OIDC <<code-flow-user-info,UserInfo>> approach, with `UserInfo` fetched by Quarkus OIDC on your behalf.
ja_jp: OIDC の場合は、認証の有効性の証明として ID トークンを検証しますが、OAuth2 の場合はアクセストークンを検証します。 これは、アクセストークンを必要とし、通常はユーザー情報を返すエンドポイントを後で呼び出すことによって実行されます。 これは、OIDC <<code-flow-user-info,UserInfo>> と同様のアプローチで、ユーザーに代わって Quarkus OIDC が `UserInfo` を取得します。

source: For Podman: https://podman-desktop.io/docs/compose/setting-up-compose[Setting up Compose]
ja_jp: Podman の場合: https://podman-desktop.io/docs/compose/setting-up-compose[Compose の設定]

source: For Polaris, the incubation period was not merely an exercise in governance; it also spurred significant technical development and strategic pivots. The project demonstrated its adaptability and commitment to robust architecture by implementing several important changes, including:
ja_jp: Polaris にとって、インキュベーション期間は単なるガバナンスの練習ではなく、重要な技術開発と戦略的転換を促しました。プロジェクトは、いくつかの重要な変更を実施することで、その適応性と堅牢なアーキテクチャへのコミットメントを示しました。その変更点には以下が含まれます。

source: For Polaris, this means:
ja_jp: Polaris にとって、これは次のことを意味します。

source: For PostgreSQL, the SQL string can refer to parameters by position, using `$1`, `$2`, ...etc. Please refer to the <<Database Clients details>> section for other databases.
ja_jp: PostgreSQL の場合、SQL 文字列は `$1`、 `$2` などのように位置でパラメーターを参照することができます。他のデータベースについては、<<Database Clients details>> のセクションを参照してください。

source: For PostgreSQL, the SQL string can refer to parameters by position, using `$1`, `$2`, ...etc. Please refer to the <<reactive-sql-clients-details>> section for other databases.
ja_jp: PostgreSQL の場合、SQL 文字列は `$1`、 `$2`...などを使用して位置でパラメーターを参照できます。 他のデータベースについては <<reactive-sql-clients-details>> セクションを参照してください。

source: For PostgreSQL, the SQL string can refer to parameters by position, using `$1`, `$2`, ...etc. Please refer to the xref:reactive-sql-clients-details[Database Clients details] section for other databases.
ja_jp: PostgreSQLの場合、SQL文字列は、 `$1` , `$2` , ...などのように、位置によってパラメータを参照することができます。その他のデータベースについては、 xref:reactive-sql-clients-details[データベースクライアントの詳細] セクションを参照してください。

source: For Quarkus Maven projects dependency SBOMs can be generated with the `quarkus:dependency-sbom` goal. The outcome of the goal will be saved in a `target/<artifactId>-<version>-dependency-cyclonedx.json` file (which can be changed by setting the `outputFile` goal parameter or the `quarkus.dependency.sbom.output-file` property). The complete Quarkus build and runtime dependency graphs will be recorded in the https://cyclonedx.org/[CycloneDX] `JSON` format.
ja_jp: Quarkus Maven プロジェクトの依存関係 SBOM は、 `quarkus:dependency-sbom` ゴールを使用して生成できます。ゴールの出力は、 `target/<artifactId>-<version>-dependency-cyclonedx.json` ファイルに保存されます (`outputFile` ゴールパラメーター、または `quarkus.dependency.sbom.output-file` プロパティーを設定することで変更できます)。完全な Quarkus ビルドおよびランタイム依存関係グラフは、 https://cyclonedx.org/[CycloneDX] `JSON` 形式で記録されます。

source: For Quarkus OIDC to do it, it needs to know if the request came from SPA. By default. it checks if the `X-Requested-With` request header with its value set to either `JavaScript` or `XMLHttpRequest` is available.
ja_jp: Quarkus OIDC がこれを行うには、リクエストが SPA から来たものであるかどうかを知る必要があります。デフォルトでは、値が `JavaScript` または `XMLHttpRequest` に設定された `X-Requested-With` リクエストヘッダーが利用可能かどうかをチェックします。

source: For Quarkus Security to be able to map your security source to Jakarta Persistence entities, ensure that the Maven project in this tutorial includes the `quarkus-security-jpa` or `quarkus-security-jpa-reactive` extension.
ja_jp: Quarkus Security がセキュリティーソースを Jakarta Persistence エンティティーにマップできるようにするには、このチュートリアルの Maven プロジェクトに `quarkus-security-jpa` または `quarkus-security-jpa-reactive` エクステンションが含まれていることを確認してください。

source: For Quarkus applications, we build our own JARs for two main reasons:
ja_jp: Quarkusアプリケーションの場合、主に次の2つの理由で独自のJARを構築します。

source: For Quarkus be able to accept such access tokens, one of the two options should be available. The first option is to introspect the opaque token remotely using a provider's introspection endpoint. Token introspection is typically supported at the `OAuth2` level, and since `OIDC` is built on top of `OAuth2`, some OIDC providers such as Keycloak support the token introspection as well. However, Auth0 does not support the token introspection, you can check it by looking at the publicly available Auth0 metadata, add `/.well-known/openid-configuration` to the address of your configured Auth0 provider, and open the resulting URL, `https://dev-3ve0cgn7.us.auth0.com/.well-known/openid-configuration`. You will see that Auth0 does not have an introspection endpoint:
ja_jp: Quarkus がこのようなアクセストークンを受け入れるには、2 つのオプションのいずれかを使用できなければなりません。 最初のオプションは、プロバイダーのイントロスペクションエンドポイントを使用して、不透明トークンをリモートでイントロスペクトします。通常、トークンイントロスペクションは `OAuth2` レベルでサポートされ、 `OIDC` は `OAuth2` 上に構築されているため、Keycloak などの一部の OIDC プロバイダーもトークンイントロスペクションをサポートします。ただし、Auth0 はトークンイントロスペクションをサポートしません。確認するには、公開されている Auth0 メタデータを確認し、設定済みの Auth0 プロバイダーのアドレスに `/.well-known/openid-configuration` を追加し、その結果として得られる URL `https://dev-3ve0cgn7.us.auth0.com/.well-known/openid-configuration` を開きます。これにより、Auth0 にイントロスペクションエンドポイントがないことがわかります。

source: For Quarkus dev mode:
ja_jp: Quarkus開発モードの場合:

source: For Quarkus dev mode: `./mvnw quarkus:dev -Dquarkus.datasource.password=youshallnotpass`
ja_jp: Quarkus 開発モードの場合: `./mvnw quarkus:dev -Dquarkus.datasource.password=youshallnotpass`

source: For Quarkus security to be able to map your security source to JPA entities, ensure that the Maven project that is used in this tutorial includes the `security-jpa` extension. You can either create a new Maven project with the `security-jpa` extension or you can add the extension to an existing Maven project.
ja_jp: Quarkus セキュリティでセキュリティソースを JPA エンティティにマッピングするには、このチュートリアルで使用する Maven プロジェクト に `security-jpa` エクステンションが含まれていることを確認します。 `security-jpa` エクステンションを持つ新しい Maven プロジェクトを作成するか、既存の Maven プロジェクト にエクステンションを追加します。

source: For Quarkus tests, a generated project name in the format `quarkus-devservices-<application-name>-<random-suffix>` is used by default to ensure isolation between test runs and running dev mode services. If the top-level name attribute is specified in the Compose file, the project name in the format `<compose-name>-<random-suffix>` is used.
ja_jp: Quarkus テストの場合、テスト実行と開発モードサービスの実行との間の分離を確実にするため、デフォルトでは `quarkus-devservices-<application-name>-<random-suffix>` 形式の生成されたプロジェクト名が使用されます。Compose ファイルでトップレベルの name 属性が指定されている場合、`<compose-name>-<random-suffix>` 形式のプロジェクト名が使用されます。

source: For REST, the important method to override is `LambdaIdentityProvider.authenticate(AwsProxyRequest event)`. From this you will allocate a SecurityIdentity based on how you want to map security data from `AwsProxyRequest`.
ja_jp: REST の場合、オーバーライドする重要なメソッドは `LambdaIdentityProvider.authenticate(AwsProxyRequest event)` です。ここで、 `AwsProxyRequest` からセキュリティーデータをマップする方法に基づいて SecurityIdentity を割り当てます。

source: For Reactive Routes: `{url}/vertx/hello`
ja_jp: Reactive Routes の場合: `{url}/vertx/hello`

source: For Reactive Routes: {httpsTrigger.url}/vertx/hello
ja_jp: リアクティブルートの場合: {httpsTrigger.url}/vertx/hello

source: For Retrieval-Augmented Generation, ingest documents and business knowledge, compute embeddings, and index in vector stores. Java seamlessly connects to databases, message brokers, and vector stores, enabling RAG pipelines that are both fast and reliable.
ja_jp: Retrieval-Augmented Generation の場合、ドキュメントとビジネス知識を取り込み、埋め込みを計算し、ベクトルストアにインデックスを作成します。Java はデータベース、メッセージブローカー、ベクトルストアにシームレスに接続し、高速かつ信頼性の高い RAG パイプラインを実現します。

source: For Strimzi, you can select any image with a Kafka version which has Kraft support (2.8.1 and higher) from https://quay.io/repository/strimzi-test-container/test-container?tab=tags
ja_jp: Strimzi では、Kafka のバージョンが Kraft に対応しているもの（2.8.1 以上）であれば、 https://quay.io/repository/strimzi-test-container/test-container?tab=tags から任意のイメージを選択することができます。

source: For WebSocket clients and servers, the `Sec-WebSocket-Protocol` header in the HTTP handshake request allows negotiation of a higher-level messaging protocol. In its absence, the server and client must establish their own conventions.
ja_jp: WebSocket クライアントとサーバーの場合、HTTP ハンドシェイクリクエストの `Sec-WebSocket-Protocol` ヘッダーにより、より高レベルのメッセージングプロトコルのネゴシエーションが可能になります。このヘッダーがない場合、サーバーとクライアントは独自の規則を確立する必要があります。

source: For Windows users
ja_jp: Windows ユーザー向け

source: For Windows users:
ja_jp: Windowsユーザーの場合:

source: For Windows using Powershell
ja_jp: Powershell を使用する Windows の場合

source: For `/api/admin`:
ja_jp: `/api/admin` の場合:

source: For `/api/users/me`:
ja_jp: `/api/users/me` の場合:

source: For `==` and `!=` the following rules are applied:
ja_jp: `==` および `!=` には次のルールが適用されます。

source: For `>`, `>=`, `<`, and `\<=` the following rules are applied:
ja_jp: `>`、`>=`、`<`、および `\<=` には、次のルールが適用されます。

source: For `@OnClose` methods, the supported return types include:
ja_jp: `@OnClose` メソッドの場合、サポートされる戻り値のタイプは次のとおりです。

source: For `@OnOpen` methods, the same rules as `@On[Text|Binary]Message` apply. Thus, a method annotated with `@OnOpen` can send messages to the client immediately after connecting. The supported return types for `@OnOpen` methods are:
ja_jp: `@OnOpen` メソッドには、 `@On[Text|Binary]Message` と同じルールが適用されます。 したがって、 `@OnOpen` アノテーションが付与されたメソッドは、接続後すぐにクライアントにメッセージを送信できます。 `@OnOpen` メソッドでサポートされている戻り値のタイプは次のとおりです。

source: For `@QuarkusIntegrationTest` tests that result in launcher the application as a container, `io.quarkus.test.common.DevServicesContext` also provides access to the id of the container network on which the application container was launched (via the `containerNetworkId` method). This can be used by `QuarkusTestResourceLifecycleManager` that need to launch additional containers that the application will communicate with.
ja_jp: アプリケーションをコンテナーとしてランチャーにする `@QuarkusIntegrationTest` テストの場合、 `io.quarkus.test.common.DevServicesContext` は、アプリケーションコンテナーが起動されたコンテナーネットワークの ID へのアクセスも提供します (`containerNetworkId` メソッドを使用)。これは、アプリケーションが通信する追加のコンテナーを起動する必要がある `QuarkusTestResourceLifecycleManager` で使用できます。
